XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/usart.c
/**
  ******************************************************************************
  * File Name          : USART.c
  * Description        : This file provides code for the configuration
  *                      of the USART instances.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/


/* USER CODE BEGIN 0 */
#include "stm32l4xx_it.h"
#include "usart.h"
#include "string.h"
#include "mem_dma.h"
#include "circular_buffer.h"

#define UART_BUFFER_MALLOC


#ifdef UART_BUFFER_MALLOC
#include "stdlib.h"
#endif


#define USART1_DATA_BUFFER_SIZE               (512)            /// 定义一次性接收最大数据长度

typedef struct uart_circular_transmit_s {
    uint8_t *data;
    int16_t length;
    int16_t tail;
    int16_t head;
}uart_circular_transmit_t;


typedef struct uart_user_message_s{
    uint8_t *data;
    int16_t length;
    union{
        struct{
            uint8_t read : 1;
        };
        uint8_t val;
    }action;
    uint8_t lock;
}uart_user_message_t;


#ifdef UART_BUFFER_MALLOC
static uart_circular_transmit_t __attribute__((section(".ram1"))) uart1_rx_message = {
    .data = NULL,
    .length = -1,
    .head = 0,
    .tail = 0,
};

static uart_user_message_t __attribute__((section(".ram1"))) uart1_user_rx_message = {
        .data = NULL,
        .length = 0,
        .action.val = 0,
        .lock = 0,
};

static uart_circular_transmit_t uart1_tx_message = {
        .data = NULL,
        .length = -1,
        .head = 0,
        .tail = 0,
};
#else

static uint8_t usart1_receive_data_buffer[USART1_DATA_BUFFER_SIZE] = { 0 };
static uint8_t usart1_user_receive_data_buffer[USART1_DATA_BUFFER_SIZE] = { 0 };
static uint8_t usart1_transmit_data_buffer[USART1_DATA_BUFFER_SIZE] = { 0 };


static uart_circular_transmit_t __attribute__((section(".ram1"))) uart1_rx_message = {
    .data = usart1_receive_data_buffer,
    .length = -1,
    .head = 0,
    .tail = 0,
};

static uart_user_message_t __attribute__((section(".ram1"))) uart1_user_rx_message = {
        .data = usart1_user_receive_data_buffer,
        .length = 0,
        .action.val = 0,
};

static uart_circular_transmit_t uart1_tx_message = {
        .data = usart1_transmit_data_buffer,
        .length = -1,
        .head = 0,
        .tail = 0,
};
#endif

static UART_HandleTypeDef huart1 = { 0 };
static DMA_HandleTypeDef hdma_usart1_rx = { 0 };
static DMA_HandleTypeDef hdma_usart1_tx = { 0 };



static void dma_usart1_tx_isr_handler(void* ctx){
    HAL_DMA_IRQHandler((DMA_HandleTypeDef*)ctx);
}

static void dma_usart1_rx_isr_handler(void* ctx){
    HAL_DMA_IRQHandler((DMA_HandleTypeDef*)ctx);
}

static void usart1_isr_handler(void* ctx){
    UART_HandleTypeDef* handle = (UART_HandleTypeDef*)ctx;
    uint32_t uart_isr_flag = READ_REG(handle->Instance->ISR);
    if((uart_isr_flag & UART_FLAG_IDLE) && (handle->Instance == USART1)){   /// 空闲
        __HAL_UART_CLEAR_FLAG(handle, UART_FLAG_IDLE);

        uint32_t pos = __HAL_DMA_GET_COUNTER(handle->hdmarx);

        uart1_rx_message.tail = USART1_DATA_BUFFER_SIZE - pos;  /// 计算队尾

        uart1_rx_message.length = uart1_rx_message.tail - uart1_rx_message.head;  /// 计算队列长度, 默认队尾大于队首

        if((uart1_user_rx_message.lock) || (uart1_rx_message.length == 0)) goto end_section;
        uart1_user_rx_message.lock = 1;
        uart1_user_rx_message.action.read = 0;

        if(uart1_rx_message.length < 0){ /// 队尾小于队首
            uart1_rx_message.length = USART1_DATA_BUFFER_SIZE + uart1_rx_message.length;
            for(int i = 0; i < 2; i++){
                uint32_t cpl = 0, start = 0;
                cpl = (i == 0) ? (USART1_DATA_BUFFER_SIZE - uart1_rx_message.head) : uart1_rx_message.tail;
                start = (i == 0) ? (uart1_rx_message.head) : 0;

                if(cpl < 64){
                    memcpy(&uart1_user_rx_message.data[i * cpl], &uart1_rx_message.data[start], cpl);
                }else{
                    memcpy_dma(&uart1_user_rx_message.data[i * cpl], &uart1_rx_message.data[start], cpl);
                }
            }
        }else{
            if(uart1_rx_message.length < 64){
                memcpy(uart1_user_rx_message.data, &uart1_rx_message.data[uart1_rx_message.head], uart1_rx_message.length);
            }else{
                memcpy_dma(uart1_user_rx_message.data, &uart1_rx_message.data[uart1_rx_message.head], uart1_rx_message.length);
            }
        }
        uart1_user_rx_message.length = uart1_rx_message.length;
        uart1_user_rx_message.action.read = 1;
        uart1_user_rx_message.lock = 0;

        uart1_rx_message.head = uart1_rx_message.tail;    /// 更新队首
    }
    end_section:
    HAL_UART_IRQHandler((UART_HandleTypeDef*)ctx);
}

#if(0)
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart){
    uart_sta.dma_rx_tc = 1;
    __HAL_DMA_DISABLE_IT(huart->hdmarx, DMA_IT_HT);
    __HAL_DMA_ENABLE_IT(huart->hdmarx, DMA_IT_TC | DMA_IT_TE);
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart){
    uart_sta.dma_tx_tc = 1;
}

void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart){

}

void HAL_UART_TxHalfCpltCallback(UART_HandleTypeDef *huart){

}

void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart){

}

#endif

int usart1_initialize(UART_HandleTypeDef* *uart_handle, uint32_t baud){
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
    int err = 0;

    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1;
    PeriphClkInit.Usart1ClockSelection = RCC_USART1CLKSOURCE_PCLK2;
    HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

