XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/usart.c
    __HAL_RCC_DMA1_CLK_ENABLE();
    __HAL_RCC_USART1_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    /**USART1 GPIO Configuration
        PB6     ------> USART1_TX
        PB7     ------> USART1_RX
   */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_6 | GPIO_PIN_7);

    GPIO_InitStruct.Pin = GPIO_PIN_6 | GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* USART1 DMA Init */
    /* USART1_RX Init */
    hdma_usart1_rx.Instance = DMA1_Channel5;
    hdma_usart1_rx.Init.Request = DMA_REQUEST_2;
    hdma_usart1_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_usart1_rx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_usart1_rx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_usart1_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_usart1_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_usart1_rx.Init.Mode = DMA_CIRCULAR;
    hdma_usart1_rx.Init.Priority = DMA_PRIORITY_VERY_HIGH;
    HAL_DMA_Init(&hdma_usart1_rx);
    __HAL_LINKDMA(&huart1, hdmarx, hdma_usart1_rx);

    /* USART1_TX Init */
    hdma_usart1_tx.Instance = DMA1_Channel4;
    hdma_usart1_tx.Init.Request = DMA_REQUEST_2;
    hdma_usart1_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma_usart1_tx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_usart1_tx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_usart1_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_usart1_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_usart1_tx.Init.Mode = DMA_NORMAL;
    hdma_usart1_tx.Init.Priority = DMA_PRIORITY_VERY_HIGH;
    HAL_DMA_Init(&hdma_usart1_tx);
    __HAL_LINKDMA(&huart1, hdmatx, hdma_usart1_tx);

    ll_peripheral_isr_install(DMA1_Channel4_IRQn, dma_usart1_tx_isr_handler, huart1.hdmatx);
    ll_peripheral_isr_install(DMA1_Channel5_IRQn, dma_usart1_rx_isr_handler, huart1.hdmarx);
    ll_peripheral_isr_install(USART1_IRQn, usart1_isr_handler, &huart1);


    HAL_NVIC_SetPriority(DMA1_Channel4_IRQn, 3, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel4_IRQn);

    HAL_NVIC_SetPriority(USART1_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(USART1_IRQn);

    huart1.Instance = USART1;
    huart1.Init.BaudRate = baud;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    err = HAL_UART_DeInit(&huart1);
    err = HAL_UART_Init(&huart1);

    if(uart_handle) *uart_handle = &huart1;

#ifdef UART_BUFFER_MALLOC
    if(uart1_rx_message.data == NULL){
        uart1_rx_message.data = (uint8_t *)malloc(USART1_DATA_BUFFER_SIZE);
    }
    if(uart1_user_rx_message.data == NULL){
        uart1_user_rx_message.data = (uint8_t *)malloc(USART1_DATA_BUFFER_SIZE);
    }
    if(uart1_tx_message.data == NULL){
        uart1_tx_message.data = (uint8_t *)malloc(USART1_DATA_BUFFER_SIZE);
    }
#endif

    return err;
}

int usart1_deinitialize(UART_HandleTypeDef* *uart_handle){
    int err = 0;

    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_6 | GPIO_PIN_7);
    err = HAL_UART_DeInit(&huart1);
    HAL_DMA_DeInit(huart1.hdmarx);
    HAL_DMA_DeInit(huart1.hdmatx);

    HAL_NVIC_DisableIRQ(USART1_IRQn);

    ll_peripheral_isr_uninstall(USART1_IRQn);
    ll_peripheral_isr_uninstall(DMA1_Channel5_IRQn);
    ll_peripheral_isr_uninstall(DMA1_Channel4_IRQn);

    __HAL_RCC_USART1_CLK_DISABLE();
#ifdef UART_BUFFER_MALLOC
    if(uart1_rx_message.data){
        free(uart1_rx_message.data);
        uart1_rx_message.data = NULL;
    }
    if(uart1_user_rx_message.data){
        free(uart1_user_rx_message.data);
        uart1_user_rx_message.data = NULL;
    }
    if(uart1_tx_message.data){
        free(uart1_tx_message.data);
        uart1_tx_message.data = NULL;
    }
#endif
    if(uart_handle) *uart_handle = NULL;
    return err;
}

uint16_t usart1_start_receive(UART_HandleTypeDef *uart_handle){
    uint32_t err = 0;
    UNUSED(uart_handle);

    ll_peripheral_isr_install(DMA1_Channel5_IRQn, dma_usart1_rx_isr_handler, huart1.hdmarx);

    HAL_NVIC_SetPriority(DMA1_Channel5_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel5_IRQn);

    err = HAL_UART_Receive_DMA(&huart1, uart1_rx_message.data, USART1_DATA_BUFFER_SIZE);
    __HAL_DMA_DISABLE_IT(huart1.hdmarx, DMA_IT_HT | DMA_IT_TC);
    __HAL_UART_ENABLE_IT(&huart1, UART_IT_IDLE);
    return err;
}

void usart1_stop_receive(UART_HandleTypeDef *uart_handle){

    HAL_NVIC_DisableIRQ(DMA1_Channel5_IRQn);
    ll_peripheral_isr_uninstall(USART1_IRQn);
}

uint16_t usart1_write_bytes(UART_HandleTypeDef *uart_handle, const void* data, uint16_t length, uint32_t timeout){
    uint32_t err = 0, start_tick = 0, tick = 0, tl = 0;
    int32_t remain = length;
    (void)(uart_handle);
    start_tick = HAL_GetTick();
    tick = start_tick;

    do{
        if((huart1.gState != HAL_UART_STATE_READY) && (huart1.hdmatx->State != HAL_DMA_STATE_READY)) goto continue_section;

        uint32_t ll = (remain <= USART1_DATA_BUFFER_SIZE) ? remain : USART1_DATA_BUFFER_SIZE;

        if(ll > 64){
            memcpy_dma(uart1_tx_message.data, &data[tl], ll);
        }else{
            memcpy(uart1_tx_message.data, &data[tl], ll);
        }
        err = HAL_UART_Transmit_DMA(&huart1, uart1_tx_message.data, ll);
        __HAL_DMA_DISABLE_IT(huart1.hdmatx, DMA_IT_HT);

        if(err) goto continue_section;
        tl += ll;
        remain -= ll;
        continue_section:
        tick = HAL_GetTick();
    }while(((tick - start_tick) < timeout) && (remain > 0));
	return tl;
}

uint16_t usart1_read_bytes(UART_HandleTypeDef *uart_handle, void *data, uint16_t length, uint32_t timeout){
    uint32_t start_tick = 0, tick = 0;
    uint16_t rl = 0;
    start_tick = HAL_GetTick();
    tick = start_tick;

    do{
//        if((data == NULL) || (uart1_user_rx_message.length == 0)) break;
        if((uart1_user_rx_message.action.read == 0) || (data == NULL) || (uart1_user_rx_message.length == 0) || (uart1_user_rx_message.lock)) goto continue_section;

