XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/usart.c
        uart1_user_rx_message.lock = 1;
        rl = (length >= uart1_user_rx_message.length) ? uart1_user_rx_message.length : length;

        if(rl > 64){
            memcpy_dma(data, uart1_user_rx_message.data, rl);
        }else{
            memcpy(data, uart1_user_rx_message.data, rl);
        }
        uart1_user_rx_message.length -= rl;
        uart1_user_rx_message.lock = 0;
        uart1_user_rx_message.action.read = 0;
        break;
        continue_section:
        tick = HAL_GetTick();
    }while(((tick - start_tick) < timeout));

    return rl;
}

uint16_t usart1_bytes_available(UART_HandleTypeDef *uart_handle){
    UNUSED(uart_handle);
    if((uart1_user_rx_message.action.read) && (uart1_user_rx_message.lock == 0))
        return uart1_user_rx_message.length;
    return 0;
}

#if(0)

#define LPUART1_DATA_BUFFER_SIZE        (256)

static DMA_HandleTypeDef hdma_lpuart1_rx = {0 };
static UART_HandleTypeDef hlpuart1 = { 0 };

static uart_circular_transmit_t __attribute__((section(".ram1"))) lpuart1_rx_message = {
        .data = NULL,
        .length = -1,
        .head = 0,
        .tail = 0,
};
#if(0)
static uart_user_message_t __attribute__((section(".ram1"))) lpuart1_user_rx_message = {
        .data = NULL,
        .length = 0,
        .action.val = 0,
        .lock = 0,
};
#else

static circular_buffer_handle lpuart1_user_rx_cbuffer_handle = NULL;

#endif


static void dma_lpuart1_tx_isr_handler(void* ctx){
    HAL_DMA_IRQHandler((DMA_HandleTypeDef*)ctx);
}

static void dma_lpuart1_rx_isr_handler(void* ctx){
    DMA_HandleTypeDef * hdma = (DMA_HandleTypeDef *)ctx;

    uint32_t flag_it = hdma->DmaBaseAddress->ISR;
    uint32_t source_it = hdma->Instance->CCR;
#if(1)
    if(((flag_it & DMA_FLAG_HT7) != 0U) && ((source_it & DMA_IT_HT) != 0U)){       ///  HT
        hdma->DmaBaseAddress->IFCR = DMA_ISR_HTIF7;
        lpuart1_rx_message.tail = LPUART1_DATA_BUFFER_SIZE >> 1;  /// 计算队尾
        goto copy_data;


    }else if(((flag_it & DMA_FLAG_TC7) != 0U) && ((source_it & DMA_IT_TC) != 0U)){  /// TC
        hdma->DmaBaseAddress->IFCR = DMA_ISR_TCIF7;

        lpuart1_rx_message.tail = LPUART1_DATA_BUFFER_SIZE;  /// 计算队尾

        copy_data:
        lpuart1_rx_message.length = lpuart1_rx_message.tail - lpuart1_rx_message.head;  /// 计算队列长度, 默认队尾大于队首

        circular_buffer_insert(lpuart1_user_rx_cbuffer_handle, &lpuart1_rx_message.data[lpuart1_rx_message.head], lpuart1_rx_message.length);

#if(0)
        if((lpuart1_user_rx_message.lock) || (lpuart1_rx_message.length == 0)) goto end_section;
        lpuart1_user_rx_message.lock = 1;
        lpuart1_user_rx_message.action.read = 0;
        memcpy(lpuart1_user_rx_message.data, &lpuart1_rx_message.data[lpuart1_rx_message.head], lpuart1_rx_message.length);
        lpuart1_user_rx_message.length = lpuart1_rx_message.length;
        lpuart1_user_rx_message.lock = 0;
        lpuart1_user_rx_message.action.read = 1;
#else

#endif

        lpuart1_rx_message.head = (lpuart1_rx_message.tail == LPUART1_DATA_BUFFER_SIZE) ? 0 : lpuart1_rx_message.tail;    /// 更新队首

    }
#endif

    else{
    	HAL_DMA_IRQHandler((DMA_HandleTypeDef*)ctx);
    }
}

static void lpuart1_isr_handler(void *ctx){
    UART_HandleTypeDef* handle = (UART_HandleTypeDef*)ctx;
    uint32_t uart_isr_flag = READ_REG(handle->Instance->ISR);
//    uint32_t cr1its     = READ_REG(handle->Instance->CR1);
//    uint32_t cr3its     = READ_REG(handle->Instance->CR3);

    if((uart_isr_flag & UART_FLAG_IDLE) && (handle->Instance == LPUART1)){   /// 空闲
        __HAL_UART_CLEAR_FLAG(handle, UART_FLAG_IDLE);

        uint32_t pos = __HAL_DMA_GET_COUNTER(handle->hdmarx);

        lpuart1_rx_message.tail = LPUART1_DATA_BUFFER_SIZE - pos;  /// 计算队尾

        lpuart1_rx_message.length = lpuart1_rx_message.tail - lpuart1_rx_message.head;  /// 计算队列长度, 默认队尾大于队首
#if(0)
        if((lpuart1_user_rx_message.lock) || (lpuart1_rx_message.length == 0)) goto end_section;
        lpuart1_user_rx_message.lock = 1;
        lpuart1_user_rx_message.action.read = 0;

        if(lpuart1_rx_message.length < 0){ /// 队尾小于队首
            lpuart1_rx_message.length = LPUART1_DATA_BUFFER_SIZE + lpuart1_rx_message.length;
            for(int i = 0; i < 2; i++){
                uint32_t cpl = 0, start = 0;
                cpl = (i == 0) ? (LPUART1_DATA_BUFFER_SIZE - lpuart1_rx_message.head) : lpuart1_rx_message.tail;
                start = (i == 0) ? (lpuart1_rx_message.head) : 0;

                if(cpl < 64){
                    memcpy(&lpuart1_user_rx_message.data[i * cpl], &lpuart1_rx_message.data[start], cpl);
                }else{
                    memcpy_dma(&lpuart1_user_rx_message.data[i * cpl], &lpuart1_rx_message.data[start], cpl);
                }
            }
        }else{
            if(lpuart1_rx_message.length < 64){
                memcpy(lpuart1_user_rx_message.data, &lpuart1_rx_message.data[lpuart1_rx_message.head], lpuart1_rx_message.length);
            }else{
                memcpy_dma(lpuart1_user_rx_message.data, &lpuart1_rx_message.data[lpuart1_rx_message.head], lpuart1_rx_message.length);
            }
        }
        lpuart1_user_rx_message.length = lpuart1_rx_message.length;
        lpuart1_user_rx_message.action.read = 1;
        lpuart1_user_rx_message.lock = 0;
#else
        if(lpuart1_rx_message.length < 0){ /// 队尾小于队首
            lpuart1_rx_message.length = LPUART1_DATA_BUFFER_SIZE + lpuart1_rx_message.length;
            for(int i = 0; i < 2; i++){    /// 分段拷贝
                uint32_t cpl = 0, start = 0;
                cpl = (i == 0) ? (LPUART1_DATA_BUFFER_SIZE - lpuart1_rx_message.head) : lpuart1_rx_message.tail;
                start = (i == 0) ? (lpuart1_rx_message.head) : 0;
                circular_buffer_insert(lpuart1_user_rx_cbuffer_handle, &lpuart1_rx_message.data[start], cpl);
            }
        }else{
            circular_buffer_insert(lpuart1_user_rx_cbuffer_handle, &lpuart1_rx_message.data[lpuart1_rx_message.head], lpuart1_rx_message.length);
        }
#endif
        end_section:
        lpuart1_rx_message.head = (lpuart1_rx_message.tail == LPUART1_DATA_BUFFER_SIZE) ? 0 : lpuart1_rx_message.tail;    /// 更新队首

    }else{
    	HAL_UART_IRQHandler((UART_HandleTypeDef*)ctx);
    }

