XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/usart.c
}


int lpuart1_initialize(UART_HandleTypeDef* *uart_handle, uint32_t baud){
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
    int err = 0;

    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_LPUART1;
    PeriphClkInit.Lpuart1ClockSelection = RCC_LPUART1CLKSOURCE_LSE;
    HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

    __HAL_RCC_DMA2_CLK_ENABLE();
    __HAL_RCC_LPUART1_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    /**LPUART1 GPIO Configuration
    PB10     ------> LPUART1_RX
    PB11     ------> LPUART1_TX
    */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_10 | GPIO_PIN_11);

    GPIO_InitStruct.Pin = GPIO_PIN_10 | GPIO_PIN_11;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF8_LPUART1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* LPUART1 DMA Init */
    hdma_lpuart1_rx.Instance = DMA2_Channel7;
    hdma_lpuart1_rx.Init.Request = DMA_REQUEST_4;
    hdma_lpuart1_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma_lpuart1_rx.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma_lpuart1_rx.Init.MemInc = DMA_MINC_ENABLE;
    hdma_lpuart1_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma_lpuart1_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma_lpuart1_rx.Init.Mode = DMA_CIRCULAR;
    hdma_lpuart1_rx.Init.Priority = DMA_PRIORITY_VERY_HIGH;
    HAL_DMA_Init(&hdma_lpuart1_rx);
    __HAL_LINKDMA(&hlpuart1, hdmarx, hdma_lpuart1_rx);

    ll_peripheral_isr_install(DMA2_Channel7_IRQn, dma_lpuart1_rx_isr_handler, hlpuart1.hdmarx);
    ll_peripheral_isr_install(LPUART1_IRQn, lpuart1_isr_handler, &hlpuart1);

    HAL_NVIC_SetPriority(DMA2_Channel7_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(DMA2_Channel7_IRQn);

    HAL_NVIC_SetPriority(LPUART1_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(LPUART1_IRQn);

    hlpuart1.Instance = LPUART1;
    hlpuart1.Init.BaudRate = baud;
    hlpuart1.Init.WordLength = UART_WORDLENGTH_8B;
    hlpuart1.Init.StopBits = UART_STOPBITS_1;
    hlpuart1.Init.Parity = UART_PARITY_NONE;
    hlpuart1.Init.Mode = UART_MODE_TX_RX;
    hlpuart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    hlpuart1.Init.OverSampling = UART_OVERSAMPLING_8;
    hlpuart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    hlpuart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    err = HAL_UART_DeInit(&hlpuart1);
    err = HAL_UART_Init(&hlpuart1);

    if(uart_handle) *uart_handle = &hlpuart1;
#ifdef UART_BUFFER_MALLOC

    if(lpuart1_rx_message.data == NULL){
        lpuart1_rx_message.data = (uint8_t *)malloc(LPUART1_DATA_BUFFER_SIZE);
    }
#if(0)
    if(lpuart1_user_rx_message.data == NULL){
        lpuart1_user_rx_message.data = (uint8_t *)malloc(LPUART1_DATA_BUFFER_SIZE);
    }
#else
    if(lpuart1_user_rx_cbuffer_handle == NULL){
    	circular_buffer_create(&lpuart1_user_rx_cbuffer_handle, LPUART1_DATA_BUFFER_SIZE);
    	lpuart1_user_rx_cbuffer_handle->lowcpy = &memcpy;
    	lpuart1_user_rx_cbuffer_handle->fastcpy = &memcpy;
    }

#endif
#endif
    return err;
}

int lpuart1_deinitialize(UART_HandleTypeDef* *uart_handle){
    int err = 0;

    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_10 | GPIO_PIN_11);
    err = HAL_UART_DeInit(&hlpuart1);

    HAL_DMA_DeInit(hlpuart1.hdmarx);

    HAL_NVIC_DisableIRQ(LPUART1_IRQn);

    ll_peripheral_isr_uninstall(LPUART1_IRQn);
    ll_peripheral_isr_uninstall(DMA2_Channel7_IRQn);

    __HAL_RCC_LPUART1_CLK_DISABLE();
#ifdef UART_BUFFER_MALLOC

    if(lpuart1_rx_message.data){
        free(lpuart1_rx_message.data);
        lpuart1_rx_message.data = NULL;
    }

#if(0)
    if(lpuart1_user_rx_message.data){
        free(lpuart1_user_rx_message.data);
        lpuart1_user_rx_message.data = NULL;
    }
#else

    if(lpuart1_user_rx_cbuffer_handle){
        circular_buffer_delete(lpuart1_user_rx_cbuffer_handle);
        lpuart1_user_rx_cbuffer_handle = NULL;
    }
#endif
#endif
    if(uart_handle) *uart_handle = NULL;
    return err;
}



uint16_t lpuart1_start_receive(UART_HandleTypeDef *uart_handle){
    uint32_t err = 0;
    UNUSED(uart_handle);

//    lpuart1_rx_message.length = 0;
//    lpuart1_rx_message.head = 0;
//    lpuart1_rx_message.tail = 0;

    HAL_NVIC_EnableIRQ(LPUART1_IRQn);

    HAL_NVIC_SetPriority(DMA2_Channel7_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(DMA2_Channel7_IRQn);

    err = HAL_UART_Receive_DMA(&hlpuart1, lpuart1_rx_message.data, LPUART1_DATA_BUFFER_SIZE);
#if(0)
    __HAL_DMA_DISABLE_IT(hlpuart1.hdmarx, DMA_IT_HT | DMA_IT_TC);
#else
    __HAL_DMA_ENABLE_IT(hlpuart1.hdmarx, DMA_IT_HT | DMA_IT_TC);
#endif
    __HAL_UART_ENABLE_IT(&hlpuart1, UART_IT_IDLE);
    return err;
}

bool lpuart1_is_start_receive(UART_HandleTypeDef *uart_handle){
    bool ret = true;
    if(hlpuart1.RxState == HAL_UART_STATE_READY) ret = false;
    return ret;
}

void lpuart1_stop_receive(UART_HandleTypeDef *uart_handle){
    UNUSED(uart_handle);
    HAL_UART_DMAStop(&hlpuart1);

    HAL_NVIC_DisableIRQ(DMA2_Channel7_IRQn);
    HAL_NVIC_DisableIRQ(LPUART1_IRQn);
}



uint16_t lpuart1_read_bytes(UART_HandleTypeDef *uart_handle, void* data, uint16_t length, uint32_t timeout){
    uint32_t start_tick = 0, tick = 0;
    uint16_t rl = 0;
    start_tick = HAL_GetTick();

#if(0)
    do{
//        if((data == NULL) || (lpuart1_user_rx_message.length == 0)) goto continue_section;
        if((lpuart1_user_rx_message.lock) || (lpuart1_user_rx_message.action.read == 0) || (data == NULL) || (lpuart1_user_rx_message.length == 0)) goto continue_section;

        lpuart1_user_rx_message.lock = 1;
        rl = (length >= lpuart1_user_rx_message.length) ? lpuart1_user_rx_message.length : length;

        if(rl > 64){
            memcpy_dma(data, lpuart1_user_rx_message.data, rl);
        }else{
            memcpy(data, lpuart1_user_rx_message.data, rl);
        }
        lpuart1_user_rx_message.length -= rl;
        lpuart1_user_rx_message.lock = 0;
        break;

        continue_section:
        tick = HAL_GetTick();
    }while(((tick - start_tick) < timeout));
#else
    do{
        rl = circular_buffer_pop(lpuart1_user_rx_cbuffer_handle, data, length);
        if(rl <= 0) goto continue_section;
        break;
        continue_section:
        tick = HAL_GetTick();
    }while(((tick - start_tick) < timeout));

#endif
    return rl;
}

#else

static UART_HandleTypeDef hlpuart1 = { 0 };

static void (*char_handler)(uint8_t, void*) = NULL;
static void *char_handler_ctx = NULL;

static void lpuart1_isr_handler(void *ctx){
    UART_HandleTypeDef* huart = (UART_HandleTypeDef*)ctx;
    uint32_t isrflags = READ_REG(huart->Instance->ISR);
    uint32_t cr1its     = READ_REG(huart->Instance->CR1);
    uint32_t cr3its     = READ_REG(huart->Instance->CR3);
    uint32_t errorflags = 0;

