XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/usart.c
    errorflags = (isrflags & (uint32_t)(USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE | USART_ISR_RTOF));
    if (errorflags == 0U)
    {
        /* UART in mode Receiver ---------------------------------------------------*/

        if (((isrflags & USART_ISR_RXNE) != 0U)
            && ((cr1its & USART_CR1_RXNEIE) != 0U))
        {
            uint16_t uhMask = huart->Mask;
            uint8_t ch = (uint8_t) (READ_REG(huart->Instance->RDR) & (uint8_t)uhMask);
            __HAL_UART_SEND_REQ(huart, UART_RXDATA_FLUSH_REQUEST);
            if(char_handler){
                char_handler(ch, char_handler_ctx);
            }
        }
        return;
    }
    if (((isrflags & USART_ISR_PE) != 0U) && ((cr1its & USART_CR1_PEIE) != 0U))
    {
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_PEF);

        huart->ErrorCode |= HAL_UART_ERROR_PE;
    }
    if (((isrflags & USART_ISR_FE) != 0U) && ((cr3its & USART_CR3_EIE) != 0U))
    {
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_FEF);

        huart->ErrorCode |= HAL_UART_ERROR_FE;
    }
    if (((isrflags & USART_ISR_NE) != 0U) && ((cr3its & USART_CR3_EIE) != 0U))
    {
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_NEF);

        huart->ErrorCode |= HAL_UART_ERROR_NE;
    }
    if (((isrflags & USART_ISR_ORE) != 0U)
        && (((cr1its & USART_CR1_RXNEIE) != 0U) ||
            ((cr3its & USART_CR3_EIE) != 0U)))
    {
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_OREF);

        huart->ErrorCode |= HAL_UART_ERROR_ORE;
    }
    if (((isrflags & USART_ISR_RTOF) != 0U) && ((cr1its & USART_CR1_RTOIE) != 0U))
    {
        __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_RTOF);

        huart->ErrorCode |= HAL_UART_ERROR_RTO;
    }
    __HAL_UART_ENABLE(huart);
}

int lpuart1_initialize(UART_HandleTypeDef* *uart_handle, uint32_t baud){
    GPIO_InitTypeDef GPIO_InitStruct = {0};
    RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
    int err = 0;

    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_LPUART1;
    PeriphClkInit.Lpuart1ClockSelection = RCC_LPUART1CLKSOURCE_LSE;
    HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit);

    __HAL_RCC_DMA2_CLK_ENABLE();
    __HAL_RCC_LPUART1_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    /**LPUART1 GPIO Configuration
    PB10     ------> LPUART1_RX
    PB11     ------> LPUART1_TX
    */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_10 | GPIO_PIN_11);

    GPIO_InitStruct.Pin = GPIO_PIN_10 | GPIO_PIN_11;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF8_LPUART1;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(LPUART1_IRQn, 2, 0);
    HAL_NVIC_EnableIRQ(LPUART1_IRQn);

    hlpuart1.Instance = LPUART1;
    hlpuart1.Init.BaudRate = baud;
    hlpuart1.Init.WordLength = UART_WORDLENGTH_8B;
    hlpuart1.Init.StopBits = UART_STOPBITS_1;
    hlpuart1.Init.Parity = UART_PARITY_NONE;
    hlpuart1.Init.Mode = UART_MODE_TX_RX;
    hlpuart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    hlpuart1.Init.OverSampling = UART_OVERSAMPLING_8;
    hlpuart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    hlpuart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    err = HAL_UART_DeInit(&hlpuart1);
    err = HAL_UART_Init(&hlpuart1);

    if(uart_handle) *uart_handle = &hlpuart1;
    return err;
}

int lpuart1_deinitialize(UART_HandleTypeDef* *uart_handle){

    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_10 | GPIO_PIN_11);
    HAL_UART_DeInit(&hlpuart1);

    HAL_NVIC_DisableIRQ(LPUART1_IRQn);

    ll_peripheral_isr_uninstall(LPUART1_IRQn);

    __HAL_RCC_LPUART1_CLK_DISABLE();
    return 0;
}

void lpuart1_install_char_process_handler(void (*handler)(uint8_t, void *), void *ctx){
    char_handler = handler;
    char_handler_ctx = ctx;
}

uint16_t lpuart1_start_receive(UART_HandleTypeDef *uart_handle){
    ll_peripheral_isr_install(LPUART1_IRQn, &lpuart1_isr_handler, &hlpuart1);
    UART_MASK_COMPUTATION(&hlpuart1);

    __HAL_UART_ENABLE_IT(&hlpuart1, UART_IT_ERR);
    __HAL_UART_ENABLE_IT(&hlpuart1, UART_IT_PE);
    __HAL_UART_ENABLE_IT(&hlpuart1, UART_IT_RXNE);

    __HAL_UART_ENABLE(&hlpuart1);
}

void lpuart1_stop_receive(UART_HandleTypeDef *uart_handle){
    __HAL_UART_DISABLE(&hlpuart1);

    (void)(uint8_t)(hlpuart1.Instance->RDR);
}



#endif

uint16_t lpuart1_write_bytes(UART_HandleTypeDef *uart_handle, void* data, uint16_t length, uint32_t timeout){
     return (uint16_t)HAL_UART_Transmit(&hlpuart1, (uint8_t *)data, length, timeout);
}


void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart){
#if(0)
    if(huart->Instance == LPUART1) lpuart1_start_receive(huart);
#endif
    if(huart->Instance == USART1) usart1_start_receive(huart);
}


/* USER CODE END 0 */

/* USER CODE END 1 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
